/**
 * ═══════════════════════════════════════════════════════════════════════════
 * 📌 ملخص توجيهي | Guiding Summary
 * ═══════════════════════════════════════════════════════════════════════════
 * 🎯 المهمة: ثوابت فضاءات أسماء SVG و XML و HTML و MathML - SVG Namespaces
 * 🏛️ الدور: ثوابت مشتركة - فضاءات الأسماء القياسية لعناصر SVG
 * 📥 المستهلك: svgSanitizer, svgPathUtils, CanvasDesignerEditor
 * ═══════════════════════════════════════════════════════════════════════════
 * 🧠 الطريقة المبتكرة | Innovative Pattern:
 *    Namespace Constants: ثوابت فضاءات أسماء موحدة
 *    لعمليات إنشاء وتعديل وسوم SVG بشكل آمن
 * ═══════════════════════════════════════════════════════════════════════════
 * ⚠️ نقاط الخطر الإلزامية | Mandatory Gotchas:
 *    1. فضاءات الأسماء يجب أن تكون صحيحة لـ SVG
 *    2. XLINK قد يتطلب namespace خاص
 * ═══════════════════════════════════════════════════════════════════════════
 * 🩹 البرمجة الدفاعية | Defensive Coding:
 *    - استخدام readonly لمنع التعديل
 *    - فحص صحة فضاء الاسم قبل الاستخدام
 * ═══════════════════════════════════════════════════════════════════════════
 * ©️ جميع الحقوق محفوظة ©️ - 2026
 * (يُحظر التعديل على هذا الملف دون تحديث هذا السجل)
 * ═══════════════════════════════════════════════════════════════════════════
 */

export const NS = {
  SVG: 'http://www.w3.org/2000/svg',
  XLINK: 'http://www.w3.org/1999/xlink',
  XML: 'http://www.w3.org/XML/1998/namespace',
  XMLNS: 'http://www.w3.org/2000/xmlns/',
  HTML: 'http://www.w3.org/1999/xhtml',
  MATH: 'http://www.w3.org/1998/Math/MathML',
  SE: 'http://svg-edit.googlecode.com',
} as const;

export type NamespaceKey = keyof typeof NS;
