/**
 * ═══════════════════════════════════════════════════════════════════════════
 * 📌 ملخص توجيهي | Guiding Summary
 * ═══════════════════════════════════════════════════════════════════════════
 * 🎯 المهمة: المدخل الموحد لمحرك المتجهات الفيكتوري - Vector Engine Entry Point
 * 🏛️ الدور: Barrel Export - يُصدّر كل أجزاء محرك المتجهات
 * 📥 المستهلك: كل ملفات المشروع التي تحتاج عمليات فيكتورية
 * ═══════════════════════════════════════════════════════════════════════════
 * 🧠 الطريقة المبتكرة | Innovative Pattern:
 *    Barrel Export: تصدير موحد يسهل الاستيراد ويدعم Tree Shaking
 * ═══════════════════════════════════════════════════════════════════════════
 * ⚠️ نقاط الخطر الإلزامية | Mandatory Gotchas:
 *    1. تجنب circular imports
 *    2. كل جزء يجب أن يكون مصدراً هنا
 *    3. الترتيب يجب أن يسمح بالـ Tree Shaking
 * ═══════════════════════════════════════════════════════════════════════════
 * 🩹 البرمجة الدفاعية | Defensive Coding:
 *    - استخدام explicit exports
 *    - فحص عدم وجود exports مكررة
 *    - تحديث هذا الملف عند إضافة ملف جديد
 * ═══════════════════════════════════════════════════════════════════════════
 * ©️ جميع الحقوق محفوظة ©️ - 2026
 * (يُحظر التعديل على هذا الملف دون تحديث هذا السجل)
 * ═══════════════════════════════════════════════════════════════════════════
 */

export * from './common';
export * from './path_editor';
export * from './control_handle_manager';
export * from './snap';
export * from './ref_line';
export * from './AlignmentGuidesOverlay';
export * from './VertexPathEditorOverlay';
export * from './AutoLayoutEngine';
