/**
 * ═══════════════════════════════════════════════════════════════════════════
 * 📌 ملخص توجيهي | Guiding Summary
 * ═══════════════════════════════════════════════════════════════════════════
 * 🎯 المهمة: فهرس تصدير وحدة الإضافات - Plugins Barrel Export
 * 🏛️ الدور: فهرس تصدير - re-export PluginRegistry و BaseEditorPlugin
 * 📥 المستهلك: كل ملفات plugins والمحررات
 * ═══════════════════════════════════════════════════════════════════════════
 * 🧠 الطريقة المبتكرة | Innovative Pattern:
 *    Barrel Export Pattern: نمط التصدير الجماعي
 *    لتوحيد نقاط الدخول وتنظيم الاستيراد
 * ═══════════════════════════════════════════════════════════════════════════
 * ⚠️ نقاط الخطر الإلزامية | Mandatory Gotchas:
 *    1. التصدير يجب أن يكون كاملاً
 *    2. لا تكرار للتصديرات
 * ═══════════════════════════════════════════════════════════════════════════
 * 🩹 البرمجة الدفاعية | Defensive Coding:
 *    - استخدام export * from
 *    - فحص عدم وجود تعارض
 * ═══════════════════════════════════════════════════════════════════════════
 * ©️ جميع الحقوق محفوظة ©️ - 2026
 * (يُحظر التعديل على هذا الملف دون تحديث هذا السجل)
 * ═══════════════════════════════════════════════════════════════════════════
 */

export * from './PluginRegistry';
export * from './BaseEditorPlugin';
