/**
 * ═══════════════════════════════════════════════════════════════════════════
 * 📌 ملخص توجيهي | Guiding Summary
 * ═══════════════════════════════════════════════════════════════════════════
 * 🎯 المهمة: نقطة دخول موحدة لمحرر النصوص الغنية - Rich Text Barrel Export
 * 🏛️ الدور: Barrel Export - يُصدّر كل أجزاء محرر النصوص
 * 📥 المستهلك: RichTextPlugin, Shell
 * ═══════════════════════════════════════════════════════════════════════════
 * 🧠 الطريقة المبتكرة | Innovative Pattern:
 *    Barrel Export: تصدير موحد يسهل الاستيراد
 * ═══════════════════════════════════════════════════════════════════════════
 * ⚠️ نقاط الخطر الإلزامية | Mandatory Gotchas:
 *    1. تجنب circular imports
 *    2. كل جزء يجب أن يكون مصدراً هنا
 * ═══════════════════════════════════════════════════════════════════════════
 * 🩹 البرمجة الدفاعية | Defensive Coding:
 *    - استخدام explicit exports
 *    - تحديث هذا الملف عند إضافة ملف جديد
 * ═══════════════════════════════════════════════════════════════════════════
 * ©️ جميع الحقوق محفوظة ©️ - 2026
 * (يُحظر التعديل على هذا الملف دون تحديث هذا السجل)
 * ═══════════════════════════════════════════════════════════════════════════
 */

export * from './model';
export * from './RichTextEditor';
export * from './RichTextPlugin';
