/**
 * ═══════════════════════════════════════════════════════════════════════════
 * 📌 ملخص توجيهي | Guiding Summary
 * ═══════════════════════════════════════════════════════════════════════════
 * 🎯 المهمة: نموذج بيانات محرر مستندات PDF - PDF Editor Model
 * 🏛️ الدور: نوع مشترك - يُعيد تصدير العقود والأنواع المعتمدة لمحرر PDF
 * 📥 المستهلك: PdfEditor, PdfPlugin, كل ملفات pdf
 * ═══════════════════════════════════════════════════════════════════════════
 * 🧠 الطريقة المبتكرة | Innovative Pattern:
 *    Re-Export Model: إعادة تصدير الأنواع من المصدر الرئيسي
 *    لضمان التوافق وعدم تكرار التعريف
 * ═══════════════════════════════════════════════════════════════════════════
 * ⚠️ نقاط الخطر الإلزامية | Mandatory Gotchas:
 *    1. التصدير يجب أن يكون كاملاً
 *    2. لا تكرار للتعريفات
 *    3. هذا الملف يجب أن يبقى بسيطاً
 * ═══════════════════════════════════════════════════════════════════════════
 * 🩹 البرمجة الدفاعية | Defensive Coding:
 *    - استخدام export * from
 *    - فحص عدم وجود تعارض
 * ═══════════════════════════════════════════════════════════════════════════
 * ©️ جميع الحقوق محفوظة ©️ - 2026
 * (يُحظر التعديل على هذا الملف دون تحديث هذا السجل)
 * ═══════════════════════════════════════════════════════════════════════════
 */

export * from '../../pdf/model';
export type PdfPage = import('../../pdf/model').PdfPageStructure;
export type PdfEditorData = import('../../pdf/model').PdfDocumentModel;
