/**
 * ═══════════════════════════════════════════════════════════════════════════
 * 📌 ملخص توجيهي | Guiding Summary
 * ═══════════════════════════════════════════════════════════════════════════
 * 🎯 المهمة: مزوّد تنسيق الشيفرة - Code Formatter Provider
 * 🏛️ الدور: مزوّد مشترك - ينسّق الكود حسب قواعد اللغة
 * 📥 المستهلك: LanguageRuntime, SharedSourceCodeEditor
 * ═══════════════════════════════════════════════════════════════════════════
 * 🧠 الطريقة المبتكرة | Innovative Pattern:
 *    Language-Specific Formatting: تنسيق مخصص لكل لغة
 *    مع مراعاة المسافات والمسافة البادئة والفواصل
 * ═══════════════════════════════════════════════════════════════════════════
 * ⚠️ نقاط الخطر الإلزامية | Mandatory Gotchas:
 *    1. التنسيق يجب أن لا يغير منطق الكود
 *    2. بعض اللغات لها تنسيق خاص (Python indentation)
 *    3. التعليقات يجب الحفاظ على تنسيقها
 * ═══════════════════════════════════════════════════════════════════════════
 * 🩹 البرمجة الدفاعية | Defensive Coding:
 *    - فحص صحة الكود قبل التنسيق
 *    - إرجاع الكود الأصلي عند الخطأ
 *    - timeout على عملية التنسيق
 * ═══════════════════════════════════════════════════════════════════════════
 * ©️ جميع الحقوق محفوظة ©️ - 2026
 * (يُحظر التعديل على هذا الملف دون تحديث هذا السجل)
 * ═══════════════════════════════════════════════════════════════════════════
 */
// src/shared/engines/languages/providers/formatter-provider.ts

import type { LanguageId } from '../language-definition';

export interface FormatterProvider {
  languageId: LanguageId;
  format: (code: string) => string;
}
