/**
 * ═══════════════════════════════════════════════════════════════════════════
 * 📌 ملخص توجيهي | Guiding Summary
 * ═══════════════════════════════════════════════════════════════════════════
 * 🎯 المهمة: مزوّد التلميحات فوق الكود - Hover Info Provider
 * 🏛️ الدور: مزوّد مشترك - يعرض معلومات تفصيلية عند تمرير الفأرة
 * 📥 المستهلك: LanguageRuntime, SharedSourceCodeEditor
 * ═══════════════════════════════════════════════════════════════════════════
 * 🧠 الطريقة المبتكرة | Innovative Pattern:
 *    Token-Based Hover: تحديد الرمز تحت الفأرة وعرض معلوماته
 *    مع نوع الرمز ووصفه ومسار ملفه
 * ═══════════════════════════════════════════════════════════════════════════
 * ⚠️ نقاط الخطر الإلزامية | Mandatory Gotchas:
 *    1. Hover يجب أن يكون سريعاً جداً (< 10ms)
 *    2. المعلومات يجب أن تكون دقيقة ومفيدة
 *    3. بعض الرموز قد لا يكون لها معلومات
 * ═══════════════════════════════════════════════════════════════════════════
 * 🩹 البرمجة الدفاعية | Defensive Coding:
 *    - فحص صحة الموقع قبل البحث
 *    - إرجاع null عند عدم وجود معلومات
 *    - timeout على عملية البحث
 * ═══════════════════════════════════════════════════════════════════════════
 * ©️ جميع الحقوق محفوظة ©️ - 2026
 * (يُحظر التعديل على هذا الملف دون تحديث هذا السجل)
 * ═══════════════════════════════════════════════════════════════════════════
 */
// src/shared/engines/languages/providers/hover-provider.ts

import type { LanguageId } from '../language-definition';

export interface HoverProvider {
  languageId: LanguageId;
  provideHover: (
    code: string,
    position: { line: number; column: number }
  ) => string | null;
}
