/**
 * ═══════════════════════════════════════════════════════════════════════════
 * 📌 ملخص توجيهي | Guiding Summary
 * ═══════════════════════════════════════════════════════════════════════════
 * 🎯 المهمة: نوع النص المترجم - Localized String (Arabic/English)
 * 🏛️ الدور: نوع أساسي - يمثل نصاً ثنائى اللغة (ar, en)
 * 📥 المستهلك: كل المكونات التي تعرض نصوصاً ثنائية اللغة
 * ═══════════════════════════════════════════════════════════════════════════
 * 🧠 الطريقة المبتكرة | Innovative Pattern:
 *    Dual-Language Type: نوع بسيط يضمن وجود ترجمتين لكل نص
 *    مع helper function لاختيار اللغة الحالية
 * ═══════════════════════════════════════════════════════════════════════════
 * ⚠️ نقاط الخطر الإلزامية | Mandatory Gotchas:
 *    1. كلتا اللغتين يجب أن تكونا موجودتين
 *    2. اختيار اللغة يجب أن يعتمد على system locale
 *    3. fallback للإنجليزية إذا كانت العربية فارغة
 * ═══════════════════════════════════════════════════════════════════════════
 * 🩹 البرمجة الدفاعية | Defensive Coding:
 *    - فحص وجود النص قبل الوصول
 *    - fallback للغة الافتراضية
 *    - تعامل مع القيم الفارغة
 * ═══════════════════════════════════════════════════════════════════════════
 * ©️ جميع الحقوق محفوظة ©️ - 2026
 * (يُحظر التعديل على هذا الملف دون تحديث هذا السجل)
 * ═══════════════════════════════════════════════════════════════════════════
 */

// src/shared/primitives/LocalizedString.ts

export interface LocalizedString {
  ar: string;
  en: string;
}

export function localize(
  str: LocalizedString | string,
  lang: 'ar' | 'en' = 'ar'
): string {
  if (typeof str === 'string') return str;
  return str[lang] || str.ar || str.en || '';
}
