/**
 * ═══════════════════════════════════════════════════════════════════════════
 * 📌 ملخص توجيهي | Guiding Summary
 * ═══════════════════════════════════════════════════════════════════════════
 * 🎯 المهمة: الأنواع الأساسية للنواة - System Types (Id, Priority, etc.)
 * 🏛️ الدور: نوع أساسي - تعريفات الأنواع الأساسية المشتركة
 * 📥 المستهلك: كل ملفات المشروع التي تحتاج أنواعاً أساسية
 * ═══════════════════════════════════════════════════════════════════════════
 * 🧠 الطريقة المبتكرة | Innovative Pattern:
 *    Centralized Type Definitions: تعريفات موحدة للأنواع الأساسية
 *    لضمان التوافق بين كل المحركات
 * ═══════════════════════════════════════════════════════════════════════════
 * ⚠️ نقاط الخطر الإلزامية | Mandatory Gotchas:
 *    1. Id يجب أن يكون فريداً (UUID أو timestamp)
 *    2. Priority يجب أن تؤثر على ترتيب التنفيذ
 *    3. إضافة نوع جديد هنا فقط إذا كان شائعاً
 * ═══════════════════════════════════════════════════════════════════════════
 * 🩹 البرمجة الدفاعية | Defensive Coding:
 *    - استخدام type aliases بدلاً من any
 *    - فحص صحة Id قبل الاستخدام
 *    - fallback للأولوية العادية
 * ═══════════════════════════════════════════════════════════════════════════
 * ©️ جميع الحقوق محفوظة ©️ - 2026
 * (يُحظر التعديل على هذا الملف دون تحديث هذا السجل)
 * ═══════════════════════════════════════════════════════════════════════════
 */

// src/shared/primitives/SystemTypes.ts

export type Id = string;

export type Priority = 'low' | 'normal' | 'high' | 'critical';
