/**
 * ═══════════════════════════════════════════════════════════════════════════
 * 📌 ملخص توجيهي | Guiding Summary
 * ═══════════════════════════════════════════════════════════════════════════
 * 🎯 المهمة: تعريفات البيئة وتصريحات الأنواع الخاصة بـ Vite و CSS Modules
 * 🏛️ الدور: نواة الأنواع والمترجم
 * 📥 المستهلك: المترجم وجميع ملفات TypeScript
 * ═══════════════════════════════════════════════════════════════════════════
 * ©️ جميع الحقوق محفوظة ©️ - 2026
 * ═══════════════════════════════════════════════════════════════════════════
 */

/// <reference types="vite/client" />

declare module '*.css' {
  const content: string | Record<string, string>;
  export default content;
}
